# DataFrame

## DataFrame 생성

DataFrame은 다양한 방법으로 생성된다.

1. 리스트의 값을 딕셔너리로 사용
2. Numpy 배열 이용
3. read_csv(), read(excel() 등 이러한 함수등을 이용해 생성 할 수 있음

In [ ]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

### 1. 리스트의 값을 딕셔너리로 사용
(가장 많이 사용되는 꼴)

- key = 컬럼

- index는 자동적으로 정수로 잡힘 왜? value 각각은 시리즈 이기 때문에

In [ ]:
list_dic = {
            'state': ['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
            'year': [2000, 2001, 2002, 2001, 2002, 2003],
            'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
}
list_dic

listDf = DataFrame(list_dic)

print(listDf)

print(type(listDf.state)) # Series로 나옴
print(type(listDf.year))
# print(type(listDf.pop)) # 내장함수랑 충돌되기때문에, 오류가 발생함
# 키의 이름을 바꾸던지(번거로움) # 아래처럼 표현해야함
print(type(listDf['pop']))

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

In [ ]:
# 다시 1번 만들어보기
data1 ={
    'name':['James', 'Peter', 'Robert', 'Trump'],
    'address':['LA', 'Texas', 'LA', 'NewYork'],
    'age':[33,44,55,66]
}
df1 = DataFrame(data1)
df1

     name  address  age
0   James       LA   33
1   Peter    Texas   44
2  Robert       LA   55
3   Trump  NewYork   66

### 2. Numpy 배열 이용

1차원일때는 reshape으로 2차로 가공해 사용하자

In [ ]:
df2 = DataFrame(np.random.randint(10,100,16).reshape(4,4),
                index=list('abcd'),
                columns=list('abcd'))
df2

# 컬럼명 변경
df2.columns =['one', 'two', 'three', 'four']
df2

   one  two  three  four
a   18   36     28    31
b   85   11     32    19
c   84   18     10    59
d   28   98     39    94

### 3. 파일을 읽어들여서 DataFrame 생성

read_csv(), read(excel() 등 이러한 함수등을 이용

* CSV = Comma Seperate Values (콤마를 기준으로 분류하는 확장자)

> (tip) 데이터 분석의 가장 베이스는 읽어들이려는 데이터가 무엇인지를 알아야 하는 것이다.
>
> 데이터를 구글링해보면 어떤 데이터인지 나오는 경우가 있다.
>
> 반드시 찾아보는 습관을 기르도록 하자

In [ ]:
df3 = pd.read_csv("/content/drive/My Drive/Colab/nhj/data_analysis/down/tips.csv")
# seabon tips dataset
df3
# 몇 줄인지? 컬럼은 몇개인지? 누락데이터가 있는지? 확인하자
# 가장 비중 높은 컬럼이 앞쪽으로 오지 않을지?
# 컬럼을 보면 - 성별을 언급하고, 흡연과 팁, 주말(그 중에서도 금토일간)과 팁의 상관요소를 볼 수 있기때문에 반드시 짚고 넘어가야 한다.

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner   2.0
1         10.34  1.66    Male     No   Sun  Dinner   3.0
2         21.01  3.50    Male     No   Sun  Dinner   3.0
3         23.68  3.31    Male     No   Sun  Dinner   2.0
4         24.59  3.61  Female     No   Sun  Dinner   4.0
..          ...   ...     ...    ...   ...     ...   ...
240       27.18  2.00  Female    Yes   Sat  Dinner   2.0
241       22.67  2.00    Male    Yes   Sat  Dinner   2.0
242       17.82  1.75    Male     No   Sat  Dinner   2.0
243       18.78  3.00  Female     No  Thur  Dinner   2.0
244       25.34   NaN     NaN    NaN   NaN     NaN   NaN

[245 rows x 7 columns]

## DataFrame 구조

In [ ]:
df1
print(df1.index)
print('*'*60)
print(df1.columns)
print('*'*60)
print(df1.values) # 2차원, 매트릭스 구조로 나오는 것을 확인
print('*'*60)
print(df1.dtypes) # series, hetero~
print('*'*60)
print(df1.T) # TRANSPOSE :: 행과 열을 바꾸는 것
print('*'*60)
print(df1.info())

RangeIndex(start=0, stop=4, step=1)
************************************************************
Index(['name', 'address', 'age'], dtype='object')
************************************************************
[['James' 'LA' 33]
 ['Peter' 'Texas' 44]
 ['Robert' 'LA' 55]
 ['Trump' 'NewYork' 66]]
************************************************************
name       object
address    object
age         int64
dtype: object
************************************************************
             0      1       2        3
name     James  Peter  Robert    Trump
address     LA  Texas      LA  NewYork
age         33     44      55       66
************************************************************
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     4 non-null      object
 1   address  4 non-null      object
 2   age      4 non-null      int64
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes
None

## 가장 많이 사용하는 조회함수

In [ ]:
df3
print(df3.head(2))
print('*'*60)
print(df3.tail())
print('*'*60)
print(df3.shape)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner   2.0
1       10.34  1.66    Male     No  Sun  Dinner   3.0
************************************************************
     total_bill   tip     sex smoker   day    time  size
240       27.18  2.00  Female    Yes   Sat  Dinner   2.0
241       22.67  2.00    Male    Yes   Sat  Dinner   2.0
242       17.82  1.75    Male     No   Sat  Dinner   2.0
243       18.78  3.00  Female     No  Thur  Dinner   2.0
244       25.34   NaN     NaN    NaN   NaN     NaN   NaN
************************************************************
(245, 7)

## DataFrame 컬럼명 변경 및 추가

### 1. 컬럼 추가

In [ ]:
df1
df1['phone'] = np.nan # 결측값
df1

     name     addr  age  phone
0   James       LA   33    NaN
1   Peter    Texas   44    NaN
2  Robert       LA   55    NaN
3   Trump  NewYork   66    NaN

### 2. 컬럼명 변경(컬럼 전체 수정) :: columns

In [ ]:
df2
df2.columns = ['A-class', 'B-class', 'C-class', 'D-class']
df2

   A-class  B-class  C-class  D-class
a       18       36       28       31
b       85       11       32       19
c       84       18       10       59
d       28       98       39       94

### 3. 컬럼명 변경(컬럼 부분 수정) :: rename

딕셔너리 구조로 

변수명.rename(columns = {'origin':'update'}, inplace=True)

In [ ]:
df1
df1.rename(columns={'address':'addr'}, inplace=True)
df1

     name     addr  age
0   James       LA   33
1   Peter    Texas   44
2  Robert       LA   55
3   Trump  NewYork   66

## DataFrame 컬럼명 조회

* 조회 방법

  - loc[label] :: 라벨로 검색

  - iloc[index] :: 숫자로 검색(인덱스)

  - .at[label] :: 라벨로 스칼라 값 검색

  - .iat[index] :: 인덱스로 스칼라 값 검색

    * 스칼라값 :: one row, one column  을 의미 :: 값 하나를 의미

In [ ]:
df2.columns = ['one', 'two', 'three', 'four']
df2

   one  two  three  four
a   18   36     28    31
b   85   11     32    19
c   84   18     10    59
d   28   98     39    94

In [ ]:
df2[0:2] # 숫자 조회 - 뒷부분 포함 안함
df2['a':'b'] # 라벨 조회 - 뒷부분 포함

   one  two  three  four
a   18   36     28    31
b   85   11     32    19

In [ ]:
df2['one':'three'] # 나오지 않는데, 컬럼이기 때문에..
# 행 부분에는 이런게 없기 때문에 Heading만 출력된다.
# 컬럼 조회는 이렇게 하면 안된다.

TypeError: ignored

In [ ]:
df2[['one','three']] # 2차원으로 검색해야한다.

   one  three
a   18     28
b   85     32
c   84     10
d   28     39

#### 응용문제

df2 의 two 컬럼에서, 60보다 큰 값만 나오게 해보시오.

In [ ]:
df2
df2.iloc[3,3]

94

df1 에서 인덱스 0, 1 값들 중 addr의 값들을 가져오고 싶다.

In [ ]:
df1

     name     addr  age  phone
0   James       LA   33    NaN
1   Peter    Texas   44    NaN
2  Robert       LA   55    NaN
3   Trump  NewYork   66    NaN

In [ ]:
df1.iloc[0:2,1]

0       LA
1    Texas
Name: addr, dtype: object

df1 의 인덱스 0, 1 번째 모든 데이터를 iloc, loc로 가져오기

In [ ]:
print(df1.iloc[0:2, 0:3])
print('*'*60)
print(df1.iloc[:2, :3])
print('*'*60)
print(df1.iloc[0:2])

    name   addr  age
0  James     LA   33
1  Peter  Texas   44
************************************************************
    name   addr  age
0  James     LA   33
1  Peter  Texas   44
************************************************************
    name   addr  age  phone
0  James     LA   33    NaN
1  Peter  Texas   44    NaN

스칼라 값 가져오기:: .at, .iat

Peter의 주소 가져오기

Robert의 나이 55 가져오기

In [ ]:
df1

     name     addr  age  phone
0   James       LA   33    NaN
1   Peter    Texas   44    NaN
2  Robert       LA   55    NaN
3   Trump  NewYork   66    NaN

In [ ]:
print(df1.iat[1,1])
print(df1.iat[2,2])

Texas
55

In [ ]:
print(df1.at[1,'addr'])
print(df1.at[2,'age'])

Texas
55

In [ ]:

print(df1.iloc[1,1])
print(df1.iloc[2,2])
print('*'*60)
print(df1.loc[1,'addr'])
print(df1.loc[2,'age'])

Texas
55
************************************************************
Texas
55